In [1]:
import pandas as pd, numpy as np, matplotlib.pyplot as plt, seaborn as sns
pd.set_option("display.max_column", None)

  user_id           event_date    event_type  purchase_amount
0  c40e6a  2019-07-29 00:02:15  registration              NaN
1  a2b682  2019-07-29 00:04:46  registration              NaN
2  9ac888  2019-07-29 00:13:22  registration              NaN
3  93ff22  2019-07-29 00:16:47  registration              NaN
4  65ef85  2019-07-29 00:19:23  registration              NaN

      user_id           event_date    event_type  purchase_amount
0      c40e6a  2019-07-29 00:02:15  registration              NaN
1      a2b682  2019-07-29 00:04:46  registration              NaN
2      9ac888  2019-07-29 00:13:22  registration              NaN
3      93ff22  2019-07-29 00:16:47  registration              NaN
4      65ef85  2019-07-29 00:19:23  registration              NaN
...       ...                  ...           ...              ...
79737  930c23  2019-09-01 23:57:41  simple_event              NaN
79738  a84999  2019-09-01 23:57:50  simple_event              NaN
79739  175e4d  2019-09-01 23:59:40  simple_event              NaN
79740  1c2210  2019-09-01 23:59:51  simple_event              NaN
79741  d799dc  2019-09-01 23:59:54  simple_event              NaN

[79742 rows x 4 columns]

In [4]:
df_event.event_date.dtype

dtype('O')

In [5]:
# removing the time for the datetime
date = pd.to_datetime(df_event['event_date'], infer_datetime_format=True).dt.date

In [6]:
df_event['event_date'] = pd.to_datetime(date, infer_datetime_format=True)
df_event['event_date'].dtype

dtype('<M8[ns]')

In [7]:
df_event.head()

  user_id event_date    event_type  purchase_amount
0  c40e6a 2019-07-29  registration              NaN
1  a2b682 2019-07-29  registration              NaN
2  9ac888 2019-07-29  registration              NaN
3  93ff22 2019-07-29  registration              NaN
4  65ef85 2019-07-29  registration              NaN

### Question 2

In [8]:
conditions = [
   (df_event['event_date'] >= '2019-07-29') & (df_event['event_date'] <= '2019-08-04'), 
    (df_event['event_date'] >= '2019-08-05') & (df_event['event_date'] <= '2019-08-11'),
    (df_event['event_date'] >= '2019-08-12') & (df_event['event_date'] <= '2019-08-18'),
    (df_event['event_date'] >= '2019-08-19') & (df_event['event_date'] <= '2019-08-25'),
    (df_event['event_date'] >= '2019-08-26') & (df_event['event_date'] <= '2019-09-01'),
]

values = [
    "ID 31", "ID 32", "ID 33","ID 34","ID 35"
]

In [9]:
df_event['cohort'] = np.select(conditions, values,"")

In [10]:
df_event.head()

  user_id event_date    event_type  purchase_amount cohort
0  c40e6a 2019-07-29  registration              NaN  ID 31
1  a2b682 2019-07-29  registration              NaN  ID 31
2  9ac888 2019-07-29  registration              NaN  ID 31
3  93ff22 2019-07-29  registration              NaN  ID 31
4  65ef85 2019-07-29  registration              NaN  ID 31

### Question 3

In [11]:
df_event[['cohort','user_id']].groupby('cohort').count().reset_index()

  cohort  user_id
0  ID 31     5758
1  ID 32    13145
2  ID 33    18144
3  ID 34    20711
4  ID 35    21984

### Question 4